#### Terraform Format and Style 🖌`success`
<details><summary>Formatting Output</summary>

```


```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>
            
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # azurerm_container_app.api will be updated in-place
  ~ resource "azurerm_container_app" "api" {
        id                            = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fb-sbx-uks-d2e14ff1/providers/Microsoft.App/containerApps/ca-api-fb-sbx-uks-d2e14ff1"
        name                          = "ca-api-fb-sbx-uks-d2e14ff1"
        tags                          = {
            "environment" = "sbx"
            "managedby"   = "Terraform"
            "pipeline"    = "Github Actions"
            "service"     = "Api"
        }
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
                name              = "api"
                # (6 unchanged attributes hidden)

              ~ env {
                    name        = "REDIS_HOST"
                  ~ value       = "ca-redis-fb-sbx-uks-d2e14ff1--2uzv91b.internal.yellowtree-52c94e87.uksouth.azurecontainerapps.io" -> (known after apply)
                    # (1 unchanged attribute hidden)
                }

                # (6 unchanged blocks hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # azurerm_container_app.redis will be destroyed
  # (because azurerm_container_app.redis is not in configuration)
  - resource "azurerm_container_app" "redis" {
      - container_app_environment_id  = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fb-sbx-uks-d2e14ff1/providers/Microsoft.App/managedEnvironments/cae-fb-sbx-uks-d2e14ff1" -> null
      - custom_domain_verification_id = (sensitive value) -> null
      - id                            = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fb-sbx-uks-d2e14ff1/providers/Microsoft.App/containerApps/ca-redis-fb-sbx-uks-d2e14ff1" -> null
      - latest_revision_fqdn          = "ca-redis-fb-sbx-uks-d2e14ff1--j0dhvys.internal.yellowtree-52c94e87.uksouth.azurecontainerapps.io" -> null
      - latest_revision_name          = "ca-redis-fb-sbx-uks-d2e14ff1--j0dhvys" -> null
      - location                      = "uksouth" -> null
      - name                          = "ca-redis-fb-sbx-uks-d2e14ff1" -> null
      - outbound_ip_addresses         = [
          - "85.210.139.24",
        ] -> null
      - resource_group_name           = "rg-fb-sbx-uks-d2e14ff1" -> null
      - revision_mode                 = "Single" -> null
      - tags                          = {} -> null
      - workload_profile_name         = "Dedicated" -> null

      - ingress {
          - allow_insecure_connections = false -> null
          - exposed_port               = 6379 -> null
          - external_enabled           = false -> null
          - fqdn                       = "ca-redis-fb-sbx-uks-d2e14ff1.internal.yellowtree-52c94e87.uksouth.azurecontainerapps.io" -> null
          - target_port                = 6379 -> null
          - transport                  = "tcp" -> null

          - traffic_weight {
              - latest_revision = true -> null
              - percentage      = 100 -> null
                # (2 unchanged attributes hidden)
            }
        }

      - template {
          - max_replicas    = 1 -> null
          - min_replicas    = 1 -> null
            # (1 unchanged attribute hidden)

          - container {
              - args              = [] -> null
              - command           = [] -> null
              - cpu               = 0.5 -> null
              - ephemeral_storage = "2Gi" -> null
              - image             = "redis:latest" -> null
              - memory            = "1Gi" -> null
              - name              = "redis" -> null
            }
        }
    }

  # azurerm_container_app.worker will be updated in-place
  ~ resource "azurerm_container_app" "worker" {
        id                            = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fb-sbx-uks-d2e14ff1/providers/Microsoft.App/containerApps/ca-worker-fb-sbx-uks-d2e14ff1"
        name                          = "ca-worker-fb-sbx-uks-d2e14ff1"
        tags                          = {
            "environment" = "sbx"
            "managedby"   = "Terraform"
            "pipeline"    = "Github Actions"
            "service"     = "Worker"
        }
        # (9 unchanged attributes hidden)

      ~ template {
            # (3 unchanged attributes hidden)

          ~ container {
                name              = "worker"
                # (6 unchanged attributes hidden)

              ~ env {
                    name        = "REDIS_HOST"
                  ~ value       = "ca-redis-fb-sbx-uks-d2e14ff1--2uzv91b.internal.yellowtree-52c94e87.uksouth.azurecontainerapps.io" -> (known after apply)
                    # (1 unchanged attribute hidden)
                }

                # (1 unchanged block hidden)
            }
        }
    }

  # azurerm_private_dns_zone.redis will be created
  + resource "azurerm_private_dns_zone" "redis" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.redis.cache.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "rg-fb-sbx-uks-d2e14ff1"

      + soa_record (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.redis will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "redis" {
      + id                    = (known after apply)
      + name                  = "redis"
      + private_dns_zone_name = "privatelink.redis.cache.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "rg-fb-sbx-uks-d2e14ff1"
      + virtual_network_id    = "/subscriptions/f65235cd-1310-4d63-b6bc-7a8372c9bce1/resourceGroups/rg-fb-sbx-uks-d2e14ff1/providers/Microsoft.Network/virtualNetworks/vnet-fb-sbx-uks-d2e14ff1"
    }

  # azurerm_redis_cache.this will be created
  + resource "azurerm_redis_cache" "this" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "redis-fb-sbx-uks-d2e14ff1"
      + non_ssl_port_enabled          = (known after apply)
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = (known after apply)
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "rg-fb-sbx-uks-d2e14ff1"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Basic"
      + ssl_port                      = (known after apply)

      + redis_configuration {
          + authentication_enabled                 = (known after apply)
          + data_persistence_authentication_method = "SAS"
          + enable_authentication                  = true
          + maxclients                             = (known after apply)
          + maxfragmentationmemory_reserved        = (known after apply)
          + maxmemory_delta                        = (known after apply)
          + maxmemory_policy                       = "volatile-lru"
          + maxmemory_reserved                     = (known after apply)
        }
    }

Plan: 3 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ api    = (sensitive value)
  ~ client = (sensitive value)
  - redis  = (sensitive value) -> null

```

</details>

Pusher: @heathen1878
Action: pull_request
Workflow: Validate Fibonacci Infrastructure